Revit 2027 API
PrimaryDesignOptionMemberFilter Constructor
Overload List
Name | Description
PrimaryDesignOptionMemberFilter() |  Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.
PrimaryDesignOptionMemberFilter(Boolean) |  Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set.
Top
See Also
Reference
PrimaryDesignOptionMemberFilter Class
Autodesk.Revit.DB Namespace